Repository: itsBashayer/YourHarvest
Catalog: Hassadak/Localizable.xcstrings
Source language: en
Languages: ar, hi

source: %@ saved successfully.
ar: تم حفظ %@ بنجاح.
hi: %@ सफलतापूर्वक सहेजा गया।

source: %lld pieces
ar: %lld حبة

source: Adjust on wide view
ar: عدّل الإطار ليتناسب مع العرض الواسع
hi: चौड़े दृश्य के लिए फ्रेम समायोजित करें

source: Apple
ar: تفاح
hi: सेब

source: Arrange vegetables neatly
ar: رتب المنتجات بطريقة واضحة
hi: सब्जियों को साफ-सुथरा और व्यवस्थित तरीके से लगाएं

source: Back
ar: رجوع
hi: वापस

source: Close
ar: إغلاق

source: count
ar: أحسب
hi: गिनती

source: Cucumber
ar: خيار
hi: खीरा

source: Date:
ar: التاريخ:
hi: तारीख़:

source: Done
ar: حسنا
hi: समाप्त

source: Ensure good lighting
ar: تأكد من أن الإضاءة جيدة
hi: उचित रोशनी सुनिश्चित करें

source: Enter your name
ar: فضلا أضف اسمك
hi: अपना नाम दर्ज करें

source: Export Report
ar: تصدير التقرير
hi: रिपोर्ट निर्यात करें

source: From:
ar: من:
hi: से

source: Generating Report...
ar: انشاء التقرير…
hi: रिपोर्ट तैयार की जा रही है...

source: history
ar: السجل
hi: इतिहास

source: History
ar: السجل
hi: इतिहास

source: How to Use the App
ar: طريقة استخدام التطبيق

source: Instructions
ar: التعليمات
hi: निर्देश

source: Item Name
ar: اسم المنتج
hi: आइटम का नाम

source: Lemon
ar: ليمون
hi: नींबू

source: No history available.
ar: لا يوجد سجلات متاحة
hi: कोई इतिहास उपलब्ध नहीं है।

source: NSCameraUsageDescription
ar: يتطلب هذا التطبيق الوصول إلى الكاميرا لاكتشاف الكائنات في الوقت الفعلي
hi: इस ऐप को वास्तविक समय में वस्तुओं का पता लगाने के लिए कैमरा एक्सेस की आवश्यकता है।

source: Ok
ar: تم
hi: ठीक है

source: OK
ar: تم
hi: ठीक है

source: pieces
ar: حبة
hi: टुकड़े

source: Please add your name
ar: فضلاً أدخل اسمك
hi: कृपया अपना नाम दर्ज करें।

source: Quantity
ar: الكمية
hi: मात्रा

source: Report
ar: التقرير
hi: रिपोर्ट

source: Retake
ar: إعادة
hi: फिर से लें

source: Save
ar: حفظ
hi: सहेजें

source: saved successfully
ar: تم الحفظ بنجاح
hi: सफलतापूर्वक सहेजा गया

source: Saved!
ar: تم الحفظ!
hi: सहेजा गया!

source: Start
ar: ابدأ
hi: शुरू करें

source: This app requires camera access to detect objects in real-time.
ar: يتطلب هذا التطبيق الوصول إلى الكاميرا لاكتشاف الكائنات في الوقت الفعلي
hi: इस ऐप को वास्तविक समय में वस्तुओं का पता लगाने के लिए कैमरा एक्सेस की आवश्यकता है।

source: Tomato
ar: طماطم
hi: टमाटर

source: Use a flat surface
ar: استخدم سطحًا مستويًا
hi: समतल सतह का उपयोग करें
